class ModelConfig:
    """模型参数配置
    """

    # 日钢标载
    RG_MAX_WEIGHT = 35000
    RG_MIN_WEIGHT = 31000
    RG_J_MIN_WEIGHT = 29000
    RG_SECOND_MIN_WEIGHT = 24000
    RG_SINGLE_UP_WEIGHT = 500
    RG_SINGLE_LOWER_WEIGHT = 2000
    RG_COMMODITY_WEIGHT = {'老区-卷板': RG_J_MIN_WEIGHT,
                           '新产品-卷板': RG_J_MIN_WEIGHT,
                           '新产品-白卷': RG_J_MIN_WEIGHT,
                           '老区-型钢': RG_MIN_WEIGHT,
                           '老区-线材': RG_MIN_WEIGHT,
                           '老区-螺纹': RG_MIN_WEIGHT,
                           '老区-开平板': RG_MIN_WEIGHT,
                           '新产品-窄带': RG_MIN_WEIGHT,
                           '新产品-冷板': RG_MIN_WEIGHT
                           }
    RG_PRIORITY = {'客户催货一级': 1, '客户催货二级': 2, '超期清理': 3}
    RG_PRIORITY_GRADE = {1: "A", 2: "B", 3: "C", 4: "D"}
    RG_LY_GROUP = {
        '赣榆区': ['U220-赣榆库', '赣榆区'],
        '黄岛区': ['U210-董家口库', '黄岛区'],
        '淮阴区': ['U288-岚北港口库2', '淮阴区'],
        '灌云县': ['U288-岚北港口库2LYG', '灌云县'],
        '连云区': ['U123-连云港东泰码头(外库)', 'U124-连云港东联码头(外库)', '连云区']
    }
    RG_COMMODITY_GROUP = {'老区-型钢': ['老区-型钢'],
                          '老区-线材': ['老区-线材'],
                          '老区-螺纹': ['老区-螺纹'],
                          '老区-开平板': ['老区-开平板'],
                          '老区-卷板': ['新产品-白卷', '老区-卷板', '新产品-卷板', '老区-线材'],
                          '新产品-白卷': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-卷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-窄带': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板'],
                          '新产品-冷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板']
                          }
    RG_COMMODITY_GROUP_FOR_SQL = {'老区-型钢': ['型钢'],
                                  '老区-线材': ['线材'],
                                  '老区-螺纹': ['螺纹'],
                                  '老区-开平板': ['开平板'],
                                  '老区-卷板': ['黑卷', '白卷', '线材'],
                                  '新产品-白卷': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-卷板': ['白卷', '黑卷', '线材', '开平板', '窄带', '冷板'],
                                  '新产品-窄带': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-冷板': ['开平板', '窄带', '冷板', '白卷', '黑卷']
                                  }

    RG_VARIETY_VEHICLE = {
        "老区-型钢": ["垫木", "垫皮", "钢丝绳"],
        "老区-线材": ["垫木"],
        "老区-螺纹": ["垫木"],
        "新产品-白卷": ["鞍座", "草垫子", "垫皮", "垫木"],
        "老区-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-窄带": ["钢丝绳", "垫皮", "垫木"],
        "新产品-冷板": ["钢丝绳"],
        "老区-开平板": ["垫木"]
    }
    RG_COMMODITY_J = ["老区-卷板", "新产品-卷板", "新产品-白卷"]
    RG_COMMODITY_LYG = ["老区-卷板", "新产品-卷板", "新产品-白卷"]
    RG_PORT_NAME_END_LYG = ["泰州钢冉码头", "泰州华纳码头",
                            "常州钢材现货交易市场码头", "常州万都码头",
                            "常州新东港码头", "常州武进码头",
                            "无锡国联皋桥码头", "无锡国信码头"]

    RG_WAREHOUSE_GROUP = [
        ['P5', 'P6', 'P7', 'P8'],
        ["B2", "E1", "E2", "E3", "E4", "F1", "F2", "H1", "T1", "X1", "X2", "Z1", "Z2", "Z4", "Z5", "Z8", "ZA", "ZC"],
        ["F10", "F20"]
    ]
    # 标准车载最大重量
    STANDARD_MAX_WEIGHT = 33000
    # 标准热镀、螺旋最大载重
    STANDARD_RD_LX_MAX_WEIGHT = 33500
    # 标准热镀、螺旋上浮重量
    STANDARD_RD_LX_UP_WEIGHT = 500
    # 标准背包上限
    STANDARD_PACKAGE_MAX_WEIGHT = 33500
    # 背包重量下浮
    PACKAGE_LOWER_WEIGHT = 2500
    # 体积上限系数
    MAX_VOLUME = 1.18
    # 分车次限制重量
    TRUCK_SPLIT_RANGE = 1000
    # 下差严重品类，后续改成通过物资代码前三位识别
    RD_LX_GROUP = ['热镀', '热度', '热镀1', '螺旋焊管', '热镀方矩管', 'QF热镀管']
    # 考虑体积的物资，后续根据成都、重庆和偏远地区调整装车量
    ITEM_ID_DICT = {
        '01C': 22,
        '01A': 16,
        '019': 20,
        '018': 34,
        '017': 34,
        '016': 34,
        '015': 34,
        '014': 34,
        '02C': 22,
        '02A': 16,
        '029': 20,
        '028': 34,
        '027': 34,
        '026': 34,
        '025': 34,
        '024': 40,
        '04C': 22,
        '04A': 16,
        '049': 20,
        '048': 34,
        '047': 34,
        '046': 34,
        '045': 34,
        '044': 40,
        '0C0': 100,
        '0C1': 75,
        '0C2': 49,
        '0C3': 25,
        '0C4': 20,
        '0C5': 18,
        '0C6': 12,
        '0C7': 8,
        '0C8': 6,
    }

    #各仓库最大车辆容纳数
    WAREHOUSE_WAIT_DICT = {
        'B2': 15,
        'E1': 10,
        'E2': 10,
        'E3': 10,
        'E4': 10,
        'F1': 10,
        'F10': 25,
        'F2': 30,
        'F20': 25,
        'H1': 15,
        'P5': 25,
        'P6': 25,
        'P7': 10,
        'P8': 15,
        'T1': 15,
        'X1': 15,
        'X2': 15,
        'Z1': 15,
        'Z2': 20,
        'Z4': 15,
        'Z5': 15,
        'Z8': 15,
        'ZA': 15,
        'ZC': 15
    }