class ModelConfig:
    """模型参数配置
    """

    # 日钢标载
    RG_MAX_WEIGHT = 35000
    RG_MIN_WEIGHT = 31000
    RG_J_MIN_WEIGHT = 29000
    RG_SECOND_MIN_WEIGHT = 24000
    RG_SINGLE_UP_WEIGHT = 500
    RG_SINGLE_LOWER_WEIGHT = 2000
    RG_COMMODITY_WEIGHT = {'老区-卷板': RG_J_MIN_WEIGHT,
                           '新产品-卷板': RG_J_MIN_WEIGHT,
                           '新产品-白卷': RG_J_MIN_WEIGHT,
                           '老区-型钢': RG_MIN_WEIGHT,
                           '老区-线材': RG_MIN_WEIGHT,
                           '老区-螺纹': RG_MIN_WEIGHT,
                           '老区-开平板': RG_MIN_WEIGHT,
                           '新产品-窄带': RG_MIN_WEIGHT,
                           '新产品-冷板': RG_MIN_WEIGHT
                           }
    RG_PRIORITY = {'客户催货一级': 1, '客户催货二级': 2, '超期清理': 3}
    RG_PRIORITY_GRADE = {1: "A", 2: "B", 3: "C", 4: "D"}
    RG_LY_GROUP = {
        '赣榆区': ['U220-赣榆库', '赣榆区'],
        '黄岛区': ['U210-董家口库', '黄岛区'],
        '淮阴区': ['U288-岚北港口库2', '淮阴区'],
        '灌云县': ['U288-岚北港口库2LYG', '灌云县'],
        '连云区': ['U123-连云港东泰码头(外库)', 'U124-连云港东联码头(外库)', '连云区']
    }
    RG_COMMODITY_GROUP = {'老区-型钢': ['老区-型钢'],
                          '老区-线材': ['老区-线材'],
                          '老区-螺纹': ['老区-螺纹'],
                          '老区-开平板': ['老区-开平板'],
                          '老区-卷板': ['新产品-白卷', '老区-卷板', '新产品-卷板', '老区-线材'],
                          '新产品-白卷': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-卷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-窄带': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板'],
                          '新产品-冷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板']
                          }
    RG_COMMODITY_GROUP_FOR_SQL = {'老区-型钢': ['型钢'],
                                  '老区-线材': ['线材'],
                                  '老区-螺纹': ['螺纹'],
                                  '老区-开平板': ['开平板'],
                                  '老区-卷板': ['黑卷', '白卷', '线材'],
                                  '新产品-白卷': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-卷板': ['白卷', '黑卷', '线材', '开平板', '窄带', '冷板'],
                                  '新产品-窄带': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-冷板': ['开平板', '窄带', '冷板', '白卷', '黑卷']
                                  }

    RG_VARIETY_VEHICLE = {
        "老区-型钢": ["垫木", "垫皮", "钢丝绳"],
        "老区-线材": ["垫木"],
        "老区-螺纹": ["垫木"],
        "新产品-白卷": ["鞍座", "草垫子", "垫皮", "垫木"],
        "老区-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-窄带": ["钢丝绳", "垫皮", "垫木"],
        "新产品-冷板": ["钢丝绳"],
        "老区-开平板": ["垫木"]
    }
    RG_COMMODITY_J = ["老区-卷板", "新产品-卷板", "新产品-白卷"]
    RG_COMMODITY_LYG = ["老区-卷板", "新产品-卷板", "新产品-白卷"]
    RG_PORT_NAME_END_LYG = ["泰州钢冉码头", "泰州华纳码头",
                            "常州钢材现货交易市场码头", "常州万都码头",
                            "常州新东港码头", "常州武进码头",
                            "无锡国联皋桥码头", "无锡国信码头"]

    RG_WAREHOUSE_GROUP = [
        ['P5', 'P6', 'P7', 'P8'],
        ["B2", "E1", "E2", "E3", "E4", "F1", "F2", "H1", "T1", "X1", "X2", "Z1", "Z2", "Z4", "Z5", "Z8", "ZA", "ZC"],
        ["F10", "F20"]
    ]

    # 各仓库最大车辆容纳数
    WAREHOUSE_WAIT_DICT = {
         'stock_name': ['B2', 'E1', 'E2', 'E3', 'E4', 'F1', 'F10', 'F2', 'F20', 'H1', 'P5', 'P6', 'P7', 'P8', 'T1',
                        'X1', 'X2', 'Z1', 'Z2', 'Z4', 'Z5', 'Z8', 'ZA', 'ZC'],
         'truck_count_std': [15, 10, 10, 10, 10, 10, 25, 30, 25, 15, 25, 25, 10, 15, 15, 15, 15, 15, 20, 15, 15, 15, 15,
                             15]
    }
    # 标准车载最大重量
    STANDARD_MAX_WEIGHT = 33000
    # 背包重量下浮
    PACKAGE_LOWER_WEIGHT = 1000
    # 体积上限系数
    MAX_VOLUME = 1.18
    # 缺省值
    DEFAULT_VOLUME = 0.001
    # 分车次限制重量
    TRUCK_SPLIT_RANGE = 1000
    # 考虑体积的物资代码前缀
    ITEM_ID_DICT = {
        # 焊管
        '112': 22,
        '111': 16,
        '110': 20,
        '109': 34,
        '108': 34,
        '107': 34,
        '106': 34,
        '105': 34,
        # 热镀
        '212': 22,
        '211': 16,
        '210': 20,
        '209': 34,
        '208': 34,
        '207': 34,
        '206': 34,
        '205': 40,
        # QF热镀管
        '712': 22,
        '711': 16,
        '710': 20,
        '709': 34,
        '708': 34,
        '707': 34,
        '706': 34,
        '705': 40,
        # 螺旋焊管
        '501': 100,
        '502': 75,
        '503': 49,
        '504': 25,
        '505': 20,
        '506': 18,
        '507': 12,
        '508': 8,
        '509': 6,
    }
